"""
Дано целое число x, верните true, если x является палиндромом.
Целое число является палиндромом, когда оно читается слева направо 
так же как и справа налево. Например, 121 - это палиндром, а 123-нет.
Ограничения

-231 <= x <= 231 - 1
"""
x = input()
if (-2**31)<= int(x) <= (2**31)-1:
    if x == x[::-1]:
        print("True")
    else:
        print("False")

